Amiya200/stm32_water_tank/Core/Src/screen.c
                if (raw)
                {
                    press_time[i] = now;
                    long_sent[i] = false;
                }
                else
                {
                    if (!long_sent[i])
                    {
                        switch (i)
                        {
                            case 0: return BTN_RESET;
                            case 1: return BTN_SELECT;
                            case 2: return BTN_UP;
                            case 3: return BTN_DOWN;
                        }
                    }
                }
            }
        }
        if (stable_state[i] && !long_sent[i])
        {
            if ((now - press_time[i]) >= LONG_PRESS_MS)
            {
                long_sent[i] = true;
                last_repeat_time[i] = now;

                switch (i)
                {
                    case 0: return BTN_RESET_LONG;
                    case 1: return BTN_SELECT_LONG;
                    case 2: return BTN_UP_LONG;
                    case 3: return BTN_DOWN_LONG;
                }
            }
        }
        if (stable_state[i] && long_sent[i])
        {
            if ((now - last_repeat_time[i]) >= REPEAT_INTERVAL_MS)
            {
                last_repeat_time[i] = now;
                continue;
            }
        }
    }

    return BTN_NONE;
}
void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    if (b == BTN_NONE)
        return;

    refreshInactivityTimer();

    /* ===== GLOBAL COUNTDOWN STOP ===== */
    if (ui == UI_COUNTDOWN && b == BTN_DOWN)
    {
        ModelHandle_StopCountdown();
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    if (b == BTN_RESET)
    {
        if (ui == UI_DASH)
        {
            ModelHandle_StartRestart();
        }
        else
        {
            switch (ui)
            {
                case UI_SETTINGS_GAP:
                case UI_SETTINGS_RETRY:
                case UI_SETTINGS_UV:
                case UI_SETTINGS_OV:
                case UI_SETTINGS_OL:
                case UI_SETTINGS_UL:
                case UI_SETTINGS_MAXRUN:
                case UI_SETTINGS_PWRREST:
                case UI_SETTINGS_FACTORY:
                case UI_DEVSET_EDIT_DATE:
                case UI_DEVSET_EDIT_TIME:
                case UI_DEVSET_EDIT_DAY:
                    ui = UI_DEVSET_MENU;
                    break;

                case UI_DEVSET_MENU:
                case UI_ADD_DEVICE_MENU:
                case UI_ADD_DEVICE_PAIR:
                case UI_ADD_DEVICE_REMOVE:
                case UI_ADD_DEVICE_PAIR_DONE:
                case UI_ADD_DEVICE_REMOVE_DONE:
                    ui = UI_MENU;
                    break;

                case UI_COUNTDOWN_EDIT_MIN:
                    ui = UI_COUNTDOWN;
                    break;

                case UI_COUNTDOWN:
                    ModelHandle_StopCountdown();
                    ui = UI_DASH;
                    break;

                default:
                    ui = UI_DASH;
                    break;
            }
        }

        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_RESET_CONFIRM)
    {
        if (b == BTN_UP || b == BTN_DOWN)
            reset_confirm_yes = !reset_confirm_yes;
        else if (b == BTN_SELECT)
        {
            if (reset_confirm_yes)
                ModelHandle_FactoryReset();

            ui = UI_DASH;
        }

        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                break;

            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s,
                                          edit_auto_maxrun_min,
                                          edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;

            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                screenNeedsRefresh = true;
                return;

            case BTN_UP:
                if (semiAutoActive) break;

                if (!timerActive)
                    ModelHandle_Button3_SinglePress();
                else
                    ModelHandle_StopTimer();

                screenNeedsRefresh = true;
                break;

            case BTN_UP_LONG:
                if (!semiAutoActive)
                    ModelHandle_StartSemiAuto();
                else
                    ModelHandle_StopSemiAuto();

                screenNeedsRefresh = true;
                break;

            case BTN_DOWN:
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    countdownActive = true;   // ensure state sync
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                    countdownActive = false;
                    ui = UI_DASH;
                }
                screenNeedsRefresh = true;
                return;

            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    ui = UI_COUNTDOWN_EDIT_MIN;
                    edit_countdown_min = 1;
                    screenNeedsRefresh = true;
                }
                break;

            default:
                break;
        }
        return;
    }

    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
            menu_select();
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1)
            menu_idx++;
        else if (b == BTN_UP && menu_idx > 0)
            menu_idx--;

        screenNeedsRefresh = true;
        return;
    }

